package skypro_ShelterBot.constants;

public class Const {
    public static String RECOMMENDATIONS_FOR_DOG = "Список рекомендаций для содержания собаки дома, либо на пре дворовом участке частного дома : \n " +
            "\n" +
            "До того, как вы привезете нового члена семьи в дом, позаботьтесь о том, чтобы купить средство от блох и клещей, зоошампунь, и корм.\n" +
            "\n" +
            "До того, как купить еду для питомца посоветуйтесь с сотрудниками приюта или куратором животного. Возможно, у него назначен специализированный корм или имеется аллергия.\n" +
            "\n" +
            "Не самые дешевые готовые корма (дешевые в основном могут только навредить) сбалансированы и снабжены необходимыми витаминами и минералами в отличие от домашней еды.\n" +
            "\n" +
            "Для собаки следует приобрести две миски (одна для еды, другая для воды), ошейник, шлейку, поводок, намордник, адресник, на котором будет кличка питомца и контактные данные владельца\n" +
            "\n" +
            "Впитывающие пеленки — некоторые приютские собаки не приучены к выгулу и могут по-началу ходить в туалет дома, не смотря на свой возраст и возможный прошлый опыт проживания в квартире.\n" +
            "\n" +
            "Новичку обязательно потребуется карантин. Это может быть любое не тесное помещение, в которое у других животных будет ограничен доступ." +
            " Чтобы обезопасить своих питомцев, надо тщательно проверять все документы и вакцинации, которые выдали в приюте.\n" +
            "\n" +
            "Ежедневая отправка отчета, о том как животное адаптируется к новым условиям содержания. Испытательный срок 30 дней ";

    public static String RECOMMENDATIONS_FOR_CAT = "Список рекомендаций для содержания кота дома, либо на пре дворовом участке частного дома : \n " +
            "\n" +
            "\n" +
            "До того, как вы привезете нового члена семьи в дом, позаботьтесь о том, чтобы купить средство от блох и клещей, зоошампунь, и корм.\n" +
            "\n" +
            "До того, как купить еду для питомца посоветуйтесь с сотрудниками приюта или куратором животного. Возможно, у него назначен специализированный корм или имеется аллергия.\n" +
            "\n" +
            "Не самые дешевые готовые корма (дешевые в основном могут только навредить) сбалансированы и снабжены необходимыми витаминами и минералами в отличие от домашней еды.\n" +
            "\n" +
            "Для кошки понадобятся миски, переноска, лоток, наполнитель, когтеточка и «антикошки» — сетки, которые не позволят ей упасть из окна. \n" +
            "\n" +
            " Желательно спрятать все провода, до которых может дотянуться питомец, ограничить доступ к бытовой химии, продуктам и растениям.\n" +
            "\n" +
            "Новичку обязательно потребуется карантин. Это может быть любое не тесное помещение, в которое у других животных будет ограничен доступ." +
            " Чтобы обезопасить своих питомцев, надо тщательно проверять все документы и вакцинации, которые выдали в приюте.\n" +
            "\n" +
            "Ежедневая отправка отчета, о том как животное адаптируется к новым условиям содержания. Испытательный срок 30 дней ";

    public static String ADOPTER_CAT = "Поздравляем вы только что прошли этап усыновления кота по кличке : ";

    public static String ADOPTER_DOG = "Поздравляем вы только что прошли процедуру усыновления собаки по кличке : ";

    public static String WISHES = " .Благодарим за выбор нашего питомника, рекомендации по уходу будут направлены в чат телеграмма.";
}
