package skypro_ShelterBot.constants;

public class Const {
    public static String RECOMMENDATIONS_FOR_DOG = "Список рекомендаций для содержания собаки дома, либо на пре дворовом участке частного дома : \n " +
            "\n" +
            "До того, как вы привезете нового члена семьи в дом, позаботьтесь о том, чтобы купить средство от блох и клещей, зоошампунь, и корм.\n" +
            "\n" +
            "До того, как купить еду для питомца посоветуйтесь с сотрудниками приюта или куратором животного. Возможно, у него назначен специализированный корм или имеется аллергия.\n" +
            "\n" +
            "Не самые дешевые готовые корма (дешевые в основном могут только навредить) сбалансированы и снабжены необходимыми витаминами и минералами в отличие от домашней еды.\n" +
            "\n" +
            "Для собаки следует приобрести две миски (одна для еды, другая для воды), ошейник, шлейку, поводок, намордник, адресник, на котором будет кличка питомца и контактные данные владельца\n" +
            "\n" +
            "Впитывающие пеленки — некоторые приютские собаки не приучены к выгулу и могут по-началу ходить в туалет дома, не смотря на свой возраст и возможный прошлый опыт проживания в квартире.\n" +
            "\n" +
            "Новичку обязательно потребуется карантин. Это может быть любое не тесное помещение, в которое у других животных будет ограничен доступ." +
            " Чтобы обезопасить своих питомцев, надо тщательно проверять все документы и вакцинации, которые выдали в приюте.\n" +
            "\n" +
            "Ежедневая отправка отчета, о том как животное адаптируется к новым условиям содержания. Испытательный срок 30 дней ";

    public static String RECOMMENDATIONS_FOR_CAT = "Список рекомендаций для содержания кота дома, либо на пре дворовом участке частного дома : \n " +
            "\n" +
            "\n" +
            "До того, как вы привезете нового члена семьи в дом, позаботьтесь о том, чтобы купить средство от блох и клещей, зоошампунь, и корм.\n" +
            "\n" +
            "До того, как купить еду для питомца посоветуйтесь с сотрудниками приюта или куратором животного. Возможно, у него назначен специализированный корм или имеется аллергия.\n" +
            "\n" +
            "Не самые дешевые готовые корма (дешевые в основном могут только навредить) сбалансированы и снабжены необходимыми витаминами и минералами в отличие от домашней еды.\n" +
            "\n" +
            "Для кошки понадобятся миски, переноска, лоток, наполнитель, когтеточка и «антикошки» — сетки, которые не позволят ей упасть из окна. \n" +
            "\n" +
            " Желательно спрятать все провода, до которых может дотянуться питомец, ограничить доступ к бытовой химии, продуктам и растениям.\n" +
            "\n" +
            "Новичку обязательно потребуется карантин. Это может быть любое не тесное помещение, в которое у других животных будет ограничен доступ." +
            " Чтобы обезопасить своих питомцев, надо тщательно проверять все документы и вакцинации, которые выдали в приюте.\n" +
            "\n" +
            "Ежедневая отправка отчета, о том как животное адаптируется к новым условиям содержания. Испытательный срок 30 дней ";

    public static String ADOPTER_CAT = "Поздравляем вы только что прошли этап усыновления кота по кличке : ";

    public static String ADOPTER_DOG = "Поздравляем вы только что прошли процедуру усыновления собаки по кличке : ";

    public static String WISHES = " .Благодарим за выбор нашего питомника, рекомендации по уходу будут направлены в чат телеграмма.";

    public static String HELP = "Для работы с чат ботом воспользуйтесь командами \n\n" +
            "/start - Приветствие, начало работы\n\n" +
            "/cat_shelter - Выбрать приют для кошек \n\n" +
            "/dog_shelter -  Выбрать приют для собак \n\n" +
            "/cat_shelter_info - Получить информацию по приюту для кошек \n\n" +
            "/dog_shelter_info - Получить информацию по приюту для собак \n\n" +
            "/volunteer_info - Получить информацию о волонтере \n\n " +
            "/send_pet_report - Отправить отчет о питомце \n\n " +
            "/show_my_pets - Посмотреть питомцев на испытательном сроке";

    public static String CAT_SHELTER_INFO = "Приют для коше Лохматый хвост\n" +
            "Здесь вы найдете для себя четвероногих друзей\n" +
            "Адрес: Горбунковский р-н, Кошкина д, Четвероногих друзей ул, дом 1 \n" +
            "Телефон приюта 8 (818) 333 333 \n" +
            "Время работы: 9-21 без перерыва на обед, без выходных \n";

    public static String DOG_SHELTER_INFO = "Приют для собак Мокрый нос\n" +
            "Здесь вы найдете для себя четвероногих друзей\n" +
            "Адрес: Собачий р-н, Собачья д, Проспект Лающего пса, дом 11 \n" +
            "Телефон приюта 8 (821) 321 3321 \n" +
            "Время работы: 9-21 без перерыва на обед, без выходных \n";

    public static String VOLUNTEER_INFO = "Служба поддержки, для оформления животных\n" +
            "Здесь вас проконсультируют опытные специалисты\n" +
            "Дадут более полный и развернутый ответ, на любой интересующий вас вопрос о животном \n" +
            "А также проведут процедуру усыновление  \n" +
            "Телефон службы волонтеров 8 (800) 000 0000 \n" +
            "Время работы: 9-21 без перерыва на обед, без выходных \n";
}
